<?php
// +----------------------------------------------------------------------
// | 星河支付系统 [ XINGHE PAYMENT SYSTEM ]
// +----------------------------------------------------------------------
// | Copyright (c) 2025 星河科技 All rights reserved.
// +----------------------------------------------------------------------
// | 技术支持与合作
// | 🛠️ 定制开发 - 专业团队提供个性化开发服务
// | 💳 支付通道对接 - 快速对接第三方支付平台
// | 🤝 业务合作 - 多种合作模式，共创双赢
// | QQ: 3909001743 | Telegram: @sy9088
// +----------------------------------------------------------------------
// | 基于 ThinkPHP 5.1 框架开发
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// [ 应用入口文件 ]
// 定义应用目录
ob_clean();
define('APP_PATH', __DIR__ . '/../application/');
// 加载框架引导文件
require __DIR__ . '/../thinkphp/start.php';
